In [ ]:
# create database
# with dataframes

In [236]:
import pandas as pd
import numpy as np

In [11]:
pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=["row1","row2","row3","row4","row5"],columns=["col1","col2","col3","col4"])

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [238]:
df=pd.DataFrame(data=np.arange(1,21).reshape(5,4),index=["row1","row2","row3","row4","row5"],columns=["col1","col2","col3","col4"])

In [17]:
df.head() ## by default top 5 row dekhtie ha aur agr hume zada line dekhnie ha toh --->> df.head(10)

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [19]:
df.tail() ## by default niche se 5 rows dekhta ha aur hume nihe se zada line dekhnie ha toh -->> df.tail(10)

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [21]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df.info() # basically ume yeh bta ha ke data ka type kya kya ha and all

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, row1 to row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      int32
 1   col2    5 non-null      int32
 2   col3    5 non-null      int32
 3   col4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [25]:
df.describe()  #isme hume yeh btata ha ke kya kya min value and max standard and all

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    9.000000  10.000000  11.000000  12.000000
std     6.324555   6.324555   6.324555   6.324555
min     1.000000   2.000000   3.000000   4.000000
25%     5.000000   6.000000   7.000000   8.000000
50%     9.000000  10.000000  11.000000  12.000000
75%    13.000000  14.000000  15.000000  16.000000
max    17.000000  18.000000  19.000000  20.000000

In [27]:
df['col1']

row1     1
row2     5
row3     9
row4    13
row5    17
Name: col1, dtype: int32

In [29]:
df.head()

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [31]:
df[['col1','col3']]

      col1  col3
row1     1     3
row2     5     7
row3     9    11
row4    13    15
row5    17    19

In [35]:
df.loc['row3']

col1     9
col2    10
col3    11
col4    12
Name: row3, dtype: int32

In [37]:
df.loc[['row2','row3']]

      col1  col2  col3  col4
row2     5     6     7     8
row3     9    10    11    12

In [39]:
df.iloc[2:4,0:2]

      col1  col2
row3     9    10
row4    13    14

In [41]:
df.head()

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [242]:
# convert dataframe into values
df.iloc[:,1:].values

array([[ 2,  3,  4],
       [ 6,  7,  8],
       [10, 11, 12],
       [14, 15, 16],
       [18, 19, 20]])

In [51]:
df.iloc[1:4,:]

      col1  col2  col3  col4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16

In [53]:
# operations

df['col3'].value_counts()

col3
3     1
7     1
11    1
15    1
19    1
Name: count, dtype: int64

In [55]:
df['col3'].unique()

array([ 3,  7, 11, 15, 19])

In [ ]:
#python pandas working with StringIO

In [11]:
from io import StringIO
import pandas as pd

In [3]:
data=('col1,col2,col3\n'
       'x,y,1\n'
       'a,b,2\n'
        'c,d,3')

In [5]:
type(data)

str

In [13]:
StringIO(data)

In [15]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [19]:
pd.read_csv(StringIO(data),usecols=['col1','col2'])

  col1 col2
0    x    y
1    a    b
2    c    d

In [21]:
pd.read_csv(StringIO(data),usecols=['col3'])

   col3
0     1
1     2
2     3

In [25]:
pd.read_csv(StringIO(data),index=0)

TypeError: read_csv() got an unexpected keyword argument 'index'

In [29]:
data.to_csv('test.csv')

AttributeError: 'str' object has no attribute 'to_csv'

In [38]:
df=data=('a,b,c,d\n'
      '1,2,3,4\n'
      '5,6,7,8\n'
      '9,10,11\n')

In [33]:
pd.read_csv(StringIO(data))

   a   b   c    d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

In [40]:
data.info() ## coming error

AttributeError: 'str' object has no attribute 'info'

In [46]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 204.0 bytes

In [50]:
df.dtypes

a      int32
b    float64
c      int32
d    float64
dtype: object

In [52]:
data=('index,a,b,c\n'
      '4,orange,bat,9.8\n'
      '8,apple,cow,76\n')

In [56]:
pd.read_csv(StringIO(data),index_col=0)

            a    b     c
index
4      orange  bat   9.8
8       apple  cow  76.0

In [66]:
pd.read_csv(StringIO(data),usecols=['a','b','c'])

        a    b     c
0  orange  bat   9.8
1   apple  cow  76.0

In [74]:
import pandas as pd
pd.read_csv('cu.item',sep='\t')

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359
...,...,...,...,...,...
395,SSEA011,College textbooks,3,T,314
396,SSEE041,Smartphones,4,T,335
397,SSFV031A,Food at elementary and secondary schools,3,T,122
398,SSGE013,Infants' equipment,3,T,356
399,SSHJ031,Infants' furniture,3,T,165

In [76]:
pd.read_csv('cu-items',sep='\t').to_csv('hello_csv') # just have to gave the proper file path to correct the error

FileNotFoundError: [Errno 2] No such file or directory: 'cu-items'

In [ ]:
# python pandas working with json
# 1.read json(read_json)
# 2.to json(to_json)
# 3.json normalize

In [78]:
data='{"emp_name":"james","email":"james12@gmail.com","job_profile":[{"titile1":"team lead","title2":"sr.developer"}]}'

In [80]:
pd.read_csv(StringIO(data))

Empty DataFrame
Columns: [{"emp_name":"james", email:"james12@gmail.com", job_profile:[{"titile1":"team lead", title2:"sr.developer"}]}]
Index: []

In [82]:
type(data)

str

In [84]:
type(StringIO(data))

_io.StringIO

In [90]:
type(data)

str

In [86]:
import pandas as pd

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\342967039.py:2: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(data)

,emp_name,email,job_profile
0,james,james12@gmail.com,"{'titile1': 'team lead', 'title2': 'sr.develop..."

In [88]:
pd.read_json(data)

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\1661395064.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(data)

,emp_name,email,job_profile
0,james,james12@gmail.com,"{'titile1': 'team lead', 'title2': 'sr.develop..."

In [92]:
pd.read_json(data)

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\1661395064.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(data)

,emp_name,email,job_profile
0,james,james12@gmail.com,"{'titile1': 'team lead', 'title2': 'sr.develop..."

In [94]:
pd.read_json(data,orient='records')

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\2317705276.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(data,orient='records')

,emp_name,email,job_profile
0,james,james12@gmail.com,"{'titile1': 'team lead', 'title2': 'sr.develop..."

In [96]:
pd.read_json(data,orient='index')

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\131370662.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(data,orient='index')

                                                             0
emp_name                                                 james
email                                        james12@gmail.com
job_profile  [{'titile1': 'team lead', 'title2': 'sr.develo...

In [100]:
import pandas as pd
df=pd.DataFrame([['a','b'],['c','d']],
                index=['row1','row2'],
                columns=['col1','col2'])

In [102]:
df

     col1 col2
row1    a    b
row2    c    d

In [104]:
df.to_json()

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [106]:
df.to_json(orient='index')

'{"row1":{"col1":"a","col2":"b"},"row2":{"col1":"c","col2":"d"}}'

In [108]:
df.to_json(orient='columns')

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [110]:
df.to_json(orient='records')

'[{"col1":"a","col2":"b"},{"col1":"c","col2":"d"}]'

In [112]:
df.to_json(orient='split')

'{"columns":["col1","col2"],"index":["row1","row2"],"data":[["a","b"],["c","d"]]}'

In [114]:
df.to_json(orient='table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"c","col2":"d"}]}'

In [116]:
schema='{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"c","col2":"d"}]}'

In [118]:
pd.read_json(schema,orient='table')

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\3334002861.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(schema,orient='table')

     col1 col2
row1    a    b
row2    c    d

In [ ]:
# json normalize :- semi-structured JSON data into a flat table

In [124]:
data=[{"emp_name":"james","email":"james12@gmail.com","job_profile":{"titile1":"team lead","title2":"sr.developer"}}]

In [128]:
type(data)

list

In [126]:
pd.json_normalize(data)

  emp_name              email job_profile.titile1 job_profile.title2
0    james  james12@gmail.com           team lead       sr.developer

In [132]:
data = [
    {
        "id": 1,
        "name": "Cole Volk",
        "fitness": {"height": 130, "weight": 60},
    },
    {"name": "Mark Reg", "fitness": {"height": 130, "weight": 60}},
    {
        "id": 2,
        "name": "Faye Raker",
        "fitness": {"height": 130, "weight": 60},
    },
]

In [134]:
pd.json_normalize(data)

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mark Reg             130              60
2  2.0  Faye Raker             130              60

In [136]:
# bascially yah pr level ander jatta ha 
pd.json_normalize(data,max_level=0)

    id        name                        fitness
0  1.0   Cole Volk  {'height': 130, 'weight': 60}
1  NaN    Mark Reg  {'height': 130, 'weight': 60}
2  2.0  Faye Raker  {'height': 130, 'weight': 60}

In [138]:
pd.json_normalize(data,max_level=1)

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mark Reg             130              60
2  2.0  Faye Raker             130              60

In [140]:
data = [
    {
        "state": "Florida",
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "counties": [
            {"name": "Dade", "population": 12345},
            {"name": "Broward", "population": 40000},
            {"name": "Palm Beach", "population": 60000},
        ],
    },
    {
        "state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "counties": [
            {"name": "Summit", "population": 1234},
            {"name": "Cuyahoga", "population": 1337},
        ],
    },
]

In [142]:
pd.json_normalize(data) # pth in each object to list of records

,state,shortname,counties,info.governor
0,Florida,FL,"[{'name': 'Dade', 'population': 12345}, {'name...",Rick Scott
1,Ohio,OH,"[{'name': 'Summit', 'population': 1234}, {'nam...",John Kasich

In [146]:
pd.json_normalize(data,"counties",["state","shortname",["info",'governor']])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

In [ ]:
# Python pandas working with HTML
# 1. read HTML(read_html)
# 2. To HTML (to_html)

In [148]:
import pandas as pd

In [150]:
html=pd.read_html("https://en.wikipedia.org/wiki/Mobile_country_code")

In [152]:
html

[   MCC  MNC Brand      Operator       Status Bands (MHz)  \
 0    1    1  TEST  Test network  Operational         any
 1    1    1  TEST  Test network  Operational         any
 2  999   99   NaN  Internal use  Operational         any
 3  999  999   NaN  Internal use  Operational         any

                               References and notes
 0                                              NaN
 1                                              NaN
 2  Internal use in private networks, no roaming[6]
 3  Internal use in private networks, no roaming[6]  ,
      Mobile country code                                    Country ISO 3166  \
 0                    289                                 A Abkhazia    GE-AB
 1                    412                                Afghanistan       AF
 2                    276                                    Albania       AL
 3                    603                                    Algeria       DZ
 4                    544  American Samoa (United States of America)       AS
 ..                   ...                                        ...      ...
 247                  452                                    Vietnam       VN
 248                  543                        W Wallis and Futuna       WF
 249                  421                                    Y Yemen       YE
 250                  645                                   Z Zambia       ZM
 251                  648                                   Zimbabwe       ZW

                                   Mobile network codes National MNC authority  \
 0             List of mobile network codes in Abkhazia                    NaN
 1          List of mobile network codes in Afghanistan                    NaN
 2              List of mobile network codes in Albania                    NaN
 3              List of mobile network codes in Algeria                    NaN
 4       List of mobile network codes in American Samoa                    NaN
 ..                                                 ...                    ...
 247        List of mobile network codes in the Vietnam                    NaN
 248  List of mobile network codes in Wallis and Futuna                    NaN
 249          List of mobile network codes in the Yemen                    NaN
 250             List of mobile network codes in Zambia                    NaN
 251           List of mobile network codes in Zimbabwe                    NaN

                       Remarks
 0    MCC is not listed by ITU
 1                         NaN
 2                         NaN
 3                         NaN
 4                         NaN
 ..                        ...
 247                       NaN
 248                       NaN
 249                       NaN
 250                       NaN
 251                       NaN

 [252 rows x 6 columns],
      MCC  MNC     Brand                    Operator           Status  \
 0    901    1       NaN                     Webbing          Unknown
 1    901    2       NaN              GlobalmatiX AG          Unknown
 2    901    3   Iridium                         NaN      Operational
 3    901    4       NaN    BBIX Singapore Pte. Ltd.          Unknown
 4    901    5       NaN        Thuraya RMSS Network      Operational
 ..   ...  ...       ...                         ...              ...
 98   901   99       NaN  Athalos Global Services BV      Operational
 99   902    1       NaN          MulteFire Alliance      Operational
 100  991    1       NaN      World's Global Telecom  Not operational
 101  991    2  5G Croco                 Orange S.A.  Not operational
 102  991    3       NaN                   Halys SAS  Not operational

     Bands (MHz)                               References and notes
 0          MVNO            Former ICO Satellite Management[51][52]
 1       Unknown  Former Sense Communications International; veh...
 2     Satellite                                                NaN
 3       Unknown                              Former Globalstar[54]
 4     Satellite                                                NaN
 ..          ...                                                ...
 98         MVNO                                               [52]
 99          LTE                                           [6][121]
 100     Unknown  temporarily assigned until 15 January 2021[100...
 101          5G  temporarily assigned until 6 August 2022[123][...
 102     Unknown  temporary assignment for trial until 5 April 2...

 [103 rows x 7 columns],
    MCC  MNC     Brand                 Operator       Status Bands (MHz)  \
 0  995    1  FonePlus  Sure (Diego Garcia) Ltd  Operational     GSM 900

                                 References and notes
 0  There appears to be no officially assigned MCC...  ,
                                vteTelecommunications  \
 0                                            History
 1                                           Pioneers
 2                                 Transmission media
 3                     Network topology and switching
 4                                       Multiplexing
 5                                           Concepts
 6                                   Types of network
 7                                   Notable networks
 8                                          Locations
 9  Telecommunication portal  Category  Outline  C...

                              vteTelecommunications.1
 0  Beacon Broadcasting Cable protection system Ca...
 1  Nasir Ahmed Edwin Howard Armstrong Mohamed M. ...
 2  Coaxial cable Fiber-optic communication optica...
 3  Bandwidth Links Nodes terminal Network switchi...
 4  Space-division Frequency-division Time-divisio...
 5  Communication protocol Computer network Data t...
 6  Cellular network Ethernet ISDN LAN Mobile NGN ...
 7  ARPANET BITNET CYCLADES FidoNet Internet Inter...
 8  Africa Americas North South Antarctica Asia Eu...
 9  Telecommunication portal  Category  Outline  C...  ]

In [154]:
type(html)

list

In [162]:
html[1]

,Year,GDP (in Bil. US$PPP),GDP per capita (in US$ PPP),GDP (in Bil. US$nominal),GDP per capita (in US$ nominal),GDP growth (real),Inflation rate (in Percent),Unemployment (in Percent),Government debt (in % of GDP)
0,1980,2857.3,12552.9,2857.3,12552.9,-0.3%,13.5%,7.2%,NaN
1,1981,3207.0,13948.7,3207.0,13948.7,2.5%,10.4%,7.6%,NaN
2,1982,3343.8,14405.0,3343.8,14405.0,-1.8%,6.2%,9.7%,NaN
3,1983,3634.0,15513.7,3634.0,15513.7,4.6%,3.2%,9.6%,NaN
4,1984,4037.7,17086.4,4037.7,17086.4,7.2%,4.4%,7.5%,NaN
5,1985,4339.0,18199.3,4339.0,18199.3,4.2%,3.5%,7.2%,NaN
6,1986,4579.6,19034.8,4579.6,19034.8,3.5%,1.9%,7.0%,NaN
7,1987,4855.3,20001.0,4855.3,20001.0,3.5%,3.6%,6.2%,NaN
8,1988,5236.4,21376.0,5236.4,21376.0,4.2%,4.1%,5.5%,NaN
9,1989,5641.6,22814.1,5641.6,22814.1,3.7%,4.8%,5.3%,NaN
10,1990,5963.1,23848.0,5963.1,23848.0,1.9%,5.4%,5.6%,NaN
11,1991,6158.1,24302.8,6158.1,24302.8,-0.1%,4.2%,6.9%,NaN
12,1992,6520.3,25392.9,6520.3,25392.9,3.5%,3.0%,7.5%,NaN
13,1993,6858.6,26364.2,6858.6,26364.2,2.8%,3.0%,6.9%,NaN
14,1994,7287.3,27674.0,7287.3,27674.0,4.0%,2.6%,6.1%,NaN
15,1995,7639.8,28671.5,7639.8,28671.5,2.7%,2.8%,5.6%,NaN
16,1996,8073.1,29947.0,8073.1,29947.0,3.8%,2.9%,5.4%,NaN
17,1997,8577.6,31440.1,8577.6,31440.1,4.4%,2.3%,4.9%,NaN
18,1998,9062.8,32833.7,9062.8,32833.7,4.5%,1.5%,4.5%,NaN
19,1999,9631.2,34496.2,9631.2,34496.2,4.8%,2.2%,4.2%,NaN
20,2000,10251.0,36312.8,10251.0,36312.8,4.1%,3.4%,4.0%,NaN
21,2001,10581.9,37101.5,10581.9,37101.5,1.0%,2.8%,4.7%,53.1%
22,2002,10929.1,37945.8,10929.1,37945.8,1.7%,1.6%,5.8%,55.5%
23,2003,11456.5,39405.4,11456.5,39405.4,2.8%,2.3%,6.0%,58.6%
24,2004,12217.2,41641.6,12217.2,41641.6,3.9%,2.7%,5.5%,66.2%
25,2005,13039.2,44034.3,13039.2,44034.3,3.5%,3.4%,5.1%,65.5%
26,2006,13815.6,46216.9,13815.6,46216.9,2.8%,3.2%,4.6%,64.2%
27,2007,14474.3,47943.4,14474.3,47943.4,2.0%,2.9%,4.6%,64.6%
28,2008,14769.9,48470.6,14769.9,48470.6,0.1%,3.8%,5.8%,73.5%
29,2009,14478.1,47102.4,14478.1,47102.4,-2.6%,-0.3%,9.3%,86.7%
30,2010,15049.0,48586.3,15049.0,48586.3,2.7%,1.6%,9.6%,95.2%
31,2011,15599.7,50008.1,15599.7,50008.1,1.6%,3.1%,8.9%,99.5%
32,2012,16254.0,51736.7,16254.0,51736.7,2.3%,2.1%,8.1%,103.1%
33,2013,16880.6,53363.9,16880.6,53363.9,2.1%,1.5%,7.4%,104.3%
34,2014,17608.1,55263.8,17608.1,55263.8,2.5%,1.6%,6.1%,104.2%
35,2015,18295.0,57006.9,18295.0,57006.9,2.9%,0.1%,5.2%,104.6%
36,2016,18804.9,58179.6,18804.9,58179.6,1.8%,1.3%,4.9%,106.5%
37,2017,19612.1,60292.9,19612.1,60292.9,2.4%,2.1%,4.4%,105.5%
38,2018,20656.5,63165.2,20656.5,63165.2,3.0%,2.4%,3.9%,106.8%
39,2019,21521.4,65504.7,21521.4,65504.7,2.5%,1.8%,3.7%,108.8%
40,2020,21322.9,64367.4,21322.9,64367.4,-2.2%,1.2%,8.1%,132.0%
41,2021,23594.0,70995.7,23594.0,70995.7,5.8%,4.7%,5.4%,125.0%
42,2022,25744.1,77191.8,25744.1,77191.8,2.0%,8.0%,3.6%,121.7%
43,2023,27357.8,81632.2,27357.8,81632.2,2.5%,4.1%,3.6%,122.1%
44,2024,28781.0,85372.6,28781.0,85372.6,2.7%,2.9%,4.0%,123.2%
45,2025,29839.6,87978.4,29839.6,87978.4,1.8%,2.0%,4.2%,126.5%
46,2026,31018.7,90902.7,31018.7,90902.7,2.0%,2.0%,4.2%,128.8%
47,2027,32274.4,94011.7,32274.4,94011.7,2.1%,2.1%,4.2%,130.7%
48,2028,33582.2,97230.6,33582.2,97230.6,2.1%,2.1%,4.1%,132.5%

In [164]:
html=pd.read_html("https://en.wikipedia.org/wiki/Minnesota",match="Average daily maximum and minimum temperatures for selected cities in Minnesota")

In [168]:
html[0]

              Location July (°F) July (°C) January (°F) January (°C)
0          Minneapolis     83/64     28/18         23/7       −4/−13
1           Saint Paul     83/63     28/17         23/6       −5/−14
2            Rochester     82/63     28/17         23/3       −5/−16
3               Duluth     76/55     24/13         19/1       −7/−17
4            St. Cloud     81/58     27/14        18/−1       −7/−18
5              Mankato     86/62     30/16         23/3       −5/−16
6  International Falls     77/52     25/11        15/−6       −9/−21

In [170]:
type(html[0])

pandas.core.frame.DataFrame

In [172]:
html[0].to_html('demo.html')

In [ ]:
# python pandas working with XML
# 1. read xml and get dataframe
# 2. convert dataframe to xml
# xml stands for extensible markup language
# xml is a markup language like html
# xml was designed to store and transport data
# xml is designed to self-descriptive

In [174]:
import pandas as pd
pd.read_xml('test.xml')

      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0

In [200]:
xml='''<?xml version='1.0' encoding='utf-8'?>
<data xmlns="http://example.com">
 <row>
   <shape>square</shape>
   <degrees>360</degrees>
   <sides>4.0</sides>
   <firstname>shagan</firstname>
 </row>
 <row>
   <shape>circle</shape>
   <degrees>360</degrees>
   <sides/>
   <firstname/>
 </row>
 <row>
   <shape>triangle</shape>
   <degrees>180</degrees>
   <sides>3.0</sides>
   <firstname/>
 </row>
</data>'''

In [184]:
pd.read_xml(xml)

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\2704978085.py:1: FutureWarning: Passing literal xml to 'read_xml' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_xml(xml)

      shape  degrees  sides firstname
0    square      360    4.0    shagan
1    circle      360    NaN      None
2  triangle      180    3.0      None

In [188]:
xml = '''<?xml version='1.0' encoding='utf-8'?>
<data>
  <row shape="square" degrees="360" sides="4.0" firstname="Krish"/>
  <row shape="circle" degrees="360"/>
  <row shape="triangle" degrees="180" sides="3.0" lastname="Naik"/>
</data>'''

In [192]:
 pd.read_xml(xml,xpath=".//row")

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\3945016705.py:1: FutureWarning: Passing literal xml to 'read_xml' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_xml(xml,xpath=".//row")

      shape  degrees  sides firstname lastname
0    square      360    4.0     Krish     None
1    circle      360    NaN      None     None
2  triangle      180    3.0      None     Naik

In [202]:
df=pd.read_xml(xml,xpath=".//doc:row",namespaces={"doc": "https://example.com"})

C:\Users\hp\AppData\Local\Temp\ipykernel_23476\1616642587.py:1: FutureWarning: Passing literal xml to 'read_xml' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df=pd.read_xml(xml,xpath=".//doc:row",namespaces={"doc": "https://example.com"})

ValueError: xpath does not return any nodes or attributes. Be sure to specify in `xpath` the parent nodes of children and attributes to parse. If document uses namespaces denoted with xmlns, be sure to define namespaces and use them in xpath.

In [204]:
df.to_xml('test.xml')

In [ ]:
# python pickling and unpickling

The pickle module implements binary protocols for serializing and de-serializing a Python object structure. “Pickling” is the process whereby a Python object hierarchy is converted into a byte stream, and “unpickling” is the inverse operation, whereby a byte stream (from a binary file or bytes-like object) is converted back into an object hierarchy. Pickling (and unpickling) is alternatively known as “serialization”, “marshalling,” 1 or “flattening”; however, to avoid confusion, the terms used here are “pickling” and “unpickling”.

Pickle in Python is primarily used in serializing and deserializing a Python object structure. In other words, it's the process of converting a Python object into a byte stream to store it in a file/database, maintain program state across sessions, or transport data over the network

In [206]:
import seaborn as sns

In [208]:
df=sns.load_dataset('tips')

In [210]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [212]:
#import the module
import pickle

In [214]:
filename='file.pkl'

In [216]:
# serialize process
pickle.dump(df,open(filename,'wb'))

In [218]:
  # can we converted serialize to unserialize
df=pickle.load(open(filename,'rb'))

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [220]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [222]:
type(df)

pandas.core.frame.DataFrame

In [224]:
 dic_example={'first_name':'shagan','last_name':'sandhu'}

In [226]:
pickle.dump(dic_example,open('test.pkl','wb'))

In [230]:
pickle.load(open('test.pkl','rb'))

{'first_name': 'shagan', 'last_name': 'sandhu'}

In [ ]:
# generl practice

In [ ]:
# to find duplicate in rows
# drop_duplicates

In [ ]:
# to remove the null value in the table
# .dropna()
# to check in specific columns then we can use subset method inside dropna
#.dropna(subset["name"])

In [ ]:
# to change the datatype in pandas 
# astype 
# and without using stringIO

In [ ]:
# missing and filling the data
# .fillna()

In [ ]:
# to concat two tables 
# pd.concat([df1,df2])

In [ ]:
# how to reshape data in pivot
# pivot method is used
# df=weather.pivot(index='month',columns='city',values='temperature')

#Practice

In [4]:
import pandas as pd

In [6]:
names=["shagan","simmo","jay","sagar"]
names

['shagan', 'simmo', 'jay', 'sagar']

In [18]:
my_series=pd.Series(names,index=["1","2","3","4"])

In [20]:
#Accessing my series become easy
my_series['4']

'sagar'

In [22]:
#Create a series using dictionary
dict={"India":"New Delhi","USA":"washington","England":"London"}
pd.Series(dict)

India       New Delhi
USA        washington
England        London
dtype: object

In [30]:
#create series using numpy
import numpy as np
list1=[]
n=int(input("Enter the value of n"))
# list2=[]
for _ in range(n):
    a=int(input("Enter the value of a : "))
    list1.append(a)
# for _ in range(n):
#     b=int(input("Enter the vale of b : "))
#     list2.append(b)
arr1=np.array(list1)
my_series1=pd.Series(arr1,index=["shagan","simmo","sagar","jay","sham"])
my_series1

Enter the value of n 5
Enter the value of a :  10
Enter the value of a :  9
Enter the value of a :  10
Enter the value of a :  8
Enter the value of a :  9

shagan    10
simmo      9
sagar     10
jay        8
sham       9
dtype: int32

In [34]:
#random series
random_arr=np.random.randint(10, size=100)
random_arr

array([5, 4, 9, 4, 4, 7, 6, 8, 1, 7, 5, 1, 2, 8, 4, 1, 0, 9, 4, 0, 2, 0,
       8, 3, 7, 9, 6, 0, 6, 1, 5, 9, 0, 8, 5, 1, 8, 6, 0, 6, 1, 9, 6, 1,
       0, 4, 3, 6, 1, 8, 3, 1, 0, 2, 7, 6, 8, 9, 5, 1, 1, 7, 6, 0, 8, 7,
       3, 2, 1, 6, 8, 9, 4, 8, 5, 3, 7, 3, 2, 4, 0, 3, 9, 0, 9, 6, 2, 9,
       4, 6, 7, 1, 6, 7, 9, 8, 7, 0, 2, 7])

In [38]:
my_series=pd.Series(random_arr)
my_series

0     5
1     4
2     9
3     4
4     4
     ..
95    8
96    7
97    0
98    2
99    7
Length: 100, dtype: int32

In [40]:
my_series.head()

0    5
1    4
2    9
3    4
4    4
dtype: int32

In [44]:
# top 15 rows we have to mention that
my_series.head(15)

0     5
1     4
2     9
3     4
4     4
5     7
6     6
7     8
8     1
9     7
10    5
11    1
12    2
13    8
14    4
dtype: int32

In [42]:
my_series.tail()

95    8
96    7
97    0
98    2
99    7
dtype: int32

In [46]:
#we can calculate the mean of the value
my_series.mean()

4.56

In [48]:
my_series.median()

5.0

In [68]:
my_series.shape

(100,)

In [60]:
my_series.describe()

count    100.000000
mean       4.560000
std        3.049491
min        0.000000
25%        1.750000
50%        5.000000
75%        7.000000
max        9.000000
dtype: float64

In [62]:
my_series.unique()

array([5, 4, 9, 7, 6, 8, 1, 2, 0, 3])

In [64]:
my_series.nunique()

10

In [5]:
#Element wise addition
import pandas as pd
series1=pd.Series([10,20,30,40])
series2=pd.Series([30,40,50])
result=series1+series2
result

0    40.0
1    60.0
2    80.0
3     NaN
dtype: float64

In [13]:
#Apply a function to each element
series3=series1.apply(lambda x:x**2)
series3

0     100
1     400
2     900
3    1600
dtype: int64

In [19]:
#mapped using series
mapping=series2.map({1:'one',2:'two',3:'three'})
mapping # error

0    NaN
1    NaN
2    NaN
dtype: object

In [31]:
#sort the value using series
import pandas as pd
sorting=pd.Series([900,20,1350,389])
series5=sorting.sort_values()
series5

1      20
3     389
0     900
2    1350
dtype: int64

In [1]:
import pandas as pd
sorting2=pd.Series([20,40,45,67,None])
missing_value=sorting2.isnull()
missing_value

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [3]:
#query a series
import pandas as pd
data={'a':10,'b':20,'c':30,'d':40,'e':50}
series=pd.Series(data)
# series8
series9=series[series > 30]

In [21]:
import pandas as pd
import numpy as np
my_arr=np.random.randint(10,size=100)
my_arr
series=pd.Series(my_arr)
series
series9=series[series>3]
series9

1     4
2     8
4     4
5     9
8     9
10    5
12    5
14    9
16    5
22    9
23    5
24    8
25    8
27    5
28    5
32    4
34    9
35    5
36    4
38    4
39    5
40    6
41    8
42    5
43    8
44    8
46    4
50    6
51    8
53    6
54    7
55    4
56    5
57    4
58    7
60    7
62    4
63    5
65    9
66    9
67    7
70    9
71    4
73    6
78    6
80    7
81    6
82    5
84    6
85    4
86    5
87    6
88    9
91    4
92    7
94    5
95    5
96    8
98    7
dtype: int32

In [23]:
series9=series[series<3]
series9

0     0
7     0
11    2
13    1
15    1
19    1
20    0
21    1
26    0
29    2
30    0
31    1
45    0
47    1
48    2
49    2
52    2
61    1
64    2
72    0
74    1
75    1
76    1
79    2
83    1
89    0
90    1
99    1
dtype: int32

In [25]:
#practice
import pandas as pd
sales_data=[120,150,130,170,160,180,140]
series=pd.Series(sales_data,index=(["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"]))
series

Monday       120
Tuesday      150
Wednesday    130
Thursday     170
Friday       160
Saturday     180
Sunday       140
dtype: int64

In [31]:
series["Tuesday"]

150

In [41]:
# here we can change the data 
series["Tuesday"]=200

In [43]:
series["Tuesday"]

200

In [49]:
# here we can change the value by positional
series.iloc[1]=200

In [51]:
#And from here we can access the value using iloc
series.iloc[1]

200

In [63]:
total=series.sum()
total

1100

In [69]:
#to find the max of the table and then find the max of the week
series9=series.max()
print(series9)
series10=series.idxmax()
print(series10)

200
Tuesday

In [71]:
series

Monday       120
Tuesday      200
Wednesday    130
Thursday     170
Friday       160
Saturday     180
Sunday       140
dtype: int64

In [73]:
#to find the lowest sales of the week
series11=series.min()
print(series11)
series12=series.idxmin()
print(series12)

120
Monday

In [75]:
series.mean()

157.14285714285714

In [83]:
series13=series[series>157]
series13

Tuesday     200
Thursday    170
Friday      160
Saturday    180
dtype: int64

In [ ]:
#doubt mapped value didn't understand the output
#what is the use of isnull() function in python -->> to find null write None value 
#we use filnna()only when there is a null value -->> and in the palce of none we can use the fillna(0) function

# DataFrame

In [87]:
#we can create an list and make a dataframe
list1=[["India","China","USA","Uk","Canada"],[93,68,45,25,30]]
list1

[['India', 'China', 'USA', 'Uk', 'Canada'], [93, 68, 45, 25, 30]]

In [97]:
import pandas as pd
my_data=pd.DataFrame(list1)
my_data

       0      1    2   3       4
0  India  China  USA  Uk  Canada
1     93     68   45  25      30

In [115]:
#using dctionary we can make dataframe
my_dict={'country':['India','china','uk'],
         'capital':['New Delhi','benjing','London'],
          'currency':['Rupee','xyz','dolar'],
         'population':[197,120,70]}
my_dict

{'country': ['India', 'china', 'uk'],
 'capital': ['New Delhi', 'benjing', 'London'],
 'currency': ['Rupee', 'xyz', 'dolar'],
 'population': [197, 120, 70]}

In [117]:
my_frame=pd.DataFrame(my_dict)
my_frame

  country    capital currency  population
0   India  New Delhi    Rupee         197
1   china    benjing      xyz         120
2      uk     London    dolar          70

In [119]:
my_frame.shape

(3, 4)

In [121]:
my_frame.columns

Index(['country', 'capital', 'currency', 'population'], dtype='object')

In [123]:
#Accessing the one columns
my_frame['country']

0    India
1    china
2       uk
Name: country, dtype: object

In [125]:
#more then one columns you want to access
my_frame[['country','currency']]

  country currency
0   India    Rupee
1   china      xyz
2      uk    dolar

In [127]:
my_frame.iloc[0]['currency']

'Rupee'

In [129]:
my_frame[my_frame['population']>100]

  country    capital currency  population
0   India  New Delhi    Rupee         197
1   china    benjing      xyz         120

In [131]:
my_frame[my_frame['population']>40]

  country    capital currency  population
0   India  New Delhi    Rupee         197
1   china    benjing      xyz         120
2      uk     London    dolar          70

In [137]:
my_frame[(my_frame['population']>70) &(my_frame['country'].str.endswith('a'))]

  country    capital currency  population
0   India  New Delhi    Rupee         197
1   china    benjing      xyz         120

In [139]:
my_frame1=pd.read_csv('titanic.csv')
my_frame1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [141]:
my_frame1.shape

(891, 12)

In [143]:
my_frame1.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [173]:
my_frame1.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [153]:
my_frame1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [155]:
my_frame1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [157]:
my_frame1.tail(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.500,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

In [163]:
my_frame1[(my_frame1['Sex']=='male') & (my_frame1['Pclass']>=2)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [165]:
my_frame1.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [167]:
my_frame1.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [169]:
my_frame1.dropna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [171]:
my_frame1[0][Pclass]

KeyError: 0